Autodesk.Revit.UI.UIView.ZoomAndCenterRectangle(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Zoom and center the view to a specified rectangle.
Since: 2013
viewCorner1: A corner of the desired view rectangle in model coordinates.
viewCorner2: The opposite corner of the desired view rectangle in model coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentException: The view corner points must differ when projected onto a plane perpendicular to the view direction.